/* чтобы избежать ошибок компиляции и вызывать данные классов больше одного раза в проекте,
в С++ прибегают к раздельной инициализации класса - заголовочные файлы и реализация. */
#pragma once
#include <string>

/// <summary>
/// Базовый класс для всех животных
/// </summary>
class BaseAnimal
{
	friend class ForceOfNature;
protected: // МОДИФИКАТОР ДОСТУПА - данные доступны только здесь и в дочерних классах.
// Реализация инкапсуляции - сокрытие прямого доступа к переменным, 
// дабы не искажать логику работы с объектами
 
	// Переменные
	float hunger = 100; // Шкала голода
	std::string name; // Наименование животного

	// конструктор
	BaseAnimal(std::string name)
	{
		this->name = name;
		isAlive = true;
	}

public: // МОДИФИКАТОР ДОСТУПА - компоненты доступны везде

	// переменные
	bool isAlive;

	// Заявляем, какие методы будут реализованы в BaseAnimal.cpp

	/// <summary>
	/// Предоставляет зверю очки насыщения
	/// </summary>
	/// <param name="nutrition">очки насыщения</param>
	void Eat(float nutrition);

	/// <summary>
	/// Заканчивает жизнь зверя
	/// </summary>
	virtual void Kill();
};