#include <iostream>
#include "Cat.cpp" // Подключение класса "Кошка"
#include "Mouse.cpp" // Подключение класса "Мышка"
#include "ForceOfNature.cpp" // Подключение статического класа-инструмента "Силы природы"

/*	ООП
* Объектно-ориентированное программирование строится на следующих принципах:
* 
* 1) АБСТРАКЦИЯ - поведение объектов обобщается в классах.
* Мы применяем принцип абстракции, создавая класс базового животного.
* Все животные хранят данные одинаково и имеют общие функции для работы с ними.
* 
* 2) НАСЛЕДОВАНИЕ - чтобы не повторять одни и те же строки кода, 
* классы могут наследовать функционал друг от друга.
* Такая практика так же упрощает рефакторинг (доработки) кода - достаточно сделать правку в родительском
* классе, чтобы правки распространились на все дочерние классы.
* 
* 3) ИНКАПСУЛЯЦИЯ - принцип сокрытия доступа к функционалу.
* Подразумевает, что пользователю не стоит давать прямой доступ к функционалу, чтобы не нарушить логику
* работы с объектами, и вместо этого предоставлять функции-инструменты.
* 
* 4) ПОЛИМОРФИЗМ - способность адаптировать работу функции под разные объекты.
* Закладывается несколькими путями:
* 1. Определяя функцию, которая будет работать с родительским классом, мы гарантируем, что она будет работать и
* 2. Перегрузка функций - создать несколько методов с одинаковым названием, 
* но разной сигнатурой (т.е. принимать на вход разные данные)
* Примером такого может служить определение методов сложения (Sum) как для целых чисел, так и для дробных. */

int main()
{
	// пример создания объекта со свойствами: животное - хищник - кошка
	Cat kitty = Cat("Kit");

	// пример создания массива объектов: животное - жертва - мышь
	Mouse mice[3]{ Mouse(), Mouse(13), Mouse(11) };

	// Примеры работы с объектами класса

	for (Mouse& mouse : mice) // Значок & - знак указателя, сигнализирует о том, что мы работаем с оригинальной
		// ячейкой памяти, где хранится информация об объекте мыши
	{
		kitty.Hunt(mouse);
	}

	for (Mouse mouse : mice)
	{
		std::cout << "Mouse status:" << mouse.isAlive << std::endl;
	}
	kitty.Hunt(mice[0]);

	ForceOfNature::SuddenDeath(kitty);
	std::cout << "Perhaps it has eaten too much?" << std::endl;
}
